In [41]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

In [42]:
weather = pd.read_csv("F:/weather_data.csv")

In [43]:
weather.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain

In [44]:
weather.shape

(7, 4)

In [45]:
weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          7 non-null      object
 1   temperature  7 non-null      int64
 2   windspeed    7 non-null      int64
 3   event        7 non-null      object
dtypes: int64(2), object(2)
memory usage: 352.0+ bytes

In [46]:
weather[(weather['temperature'] <= 50) & (weather['temperature'] >= -30)]

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
2  1/3/2017           28     -99999   Snow
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

So, what we did is that we have removed outliers from the weather data in terms of the temperatures with the 
data now reflecting a more acceptable temperature level. 
But we cannot be removing the entire row with the pretext of wrong individual parameters.

In [47]:
weather[(weather['temperature'] >= 50) | (weather['temperature'] <= -30)]

        day  temperature  windspeed  event
1  1/2/2017       -99999          7  Sunny
3  1/4/2017       -99999          7      0

In [49]:
weather['temperature'] = weather['temperature'].replace(-99999,'n/a')

So what we did is that we replaced the outlier values as showcased above with a 'n/a' comment

In [53]:
weather[(weather['windspeed'] <= 250) & (weather['windspeed'] < 0)]

        day temperature  windspeed event
2  1/3/2017          28     -99999  Snow
4  1/5/2017          32     -99999  Rain

In [54]:
weather['windspeed'] = weather['windspeed'].replace(-99999,'n/a')

Here we have also removed the outliers for the date which seemed like am unreal possibility

In [55]:
weather

        day temperature windspeed  event
0  1/1/2017          32         6   Rain
1  1/2/2017         n/a         7  Sunny
2  1/3/2017          28       n/a   Snow
3  1/4/2017         n/a         7      0
4  1/5/2017          32       n/a   Rain
5  1/6/2017          31         2  Sunny
6  1/6/2017          34         5      0

In [57]:
from datetime import datetime

In [73]:
weather['day'] = pd.to_datetime(weather['day'])

In [75]:
weather.head(2)

         day temperature windspeed  event
0 2017-01-01          32         6   Rain
1 2017-01-02         n/a         7  Sunny

So here we have modified the date type from Object

In [76]:
weather

         day temperature windspeed  event
0 2017-01-01          32         6   Rain
1 2017-01-02         n/a         7  Sunny
2 2017-01-03          28       n/a   Snow
3 2017-01-04         n/a         7      0
4 2017-01-05          32       n/a   Rain
5 2017-01-06          31         2  Sunny
6 2017-01-06          34         5      0

In [79]:
weather['event'] = weather['event'].replace('0','n/a')

In [82]:
weather

         day temperature windspeed  event
0 2017-01-01          32         6   Rain
1 2017-01-02         n/a         7  Sunny
2 2017-01-03          28       n/a   Snow
3 2017-01-04         n/a         7    n/a
4 2017-01-05          32       n/a   Rain
5 2017-01-06          31         2  Sunny
6 2017-01-06          34         5    n/a

Here, finally we have replaced the string value 0 with n/a since 0 can't be a value in a categorical column.